const qna = [
  {
    question: "지금부터 흑산으로 출발할 것 이야! 무엇을 챙겨가겠는가?",
    answer: [
      "산이라면 당연지사 지팡이지!",
      "벌써부터 허기지는 느낌이다.. 주먹밥으로 챙겨가야겠다.",
      "산이면 벌레가 많을거 같은데? 모기향을 가져가자!",
    ],
    imgsrc: "/assets/Qnaimges/qna1.gif",
    talk: [
      {
        who: ["YOU", "KUROSA"],
        content: [
          "자 이제 준비 됐어요",
          "그래 그래.. 결정이 빠른걸? \n\n이어서 한가지 중요한 의식만 치르면 된다구!",
        ],
        talkimg: ["/assets/Qnaimges/qna1.gif", "/assets/Images/talkLogo2.gif"],
      },
      {
        who: ["YOU", "KUROSA"],
        content: [
          "자 이제 준비 됐어요",
          "그래 그래.. 결정이 빠른걸? \n\n이어서 한가지 중요한 의식만 치르면 된다구!",
        ],
        talkimg: ["/assets/Qnaimges/qna1.gif", "/assets/Images/talkLogo2.gif"],
      },
      {
        who: ["YOU", "KUROSA"],
        content: [
          "자 이제 준비 됐어요",
          "그래 그래.. 결정이 빠른걸? \n\n이어서 한가지 중요한 의식만 치르면 된다구!",
        ],
        talkimg: ["/assets/Qnaimges/qna1.gif", "/assets/Images/talkLogo2.gif"],
      },
    ],
  },
  {
    question: "자, 자, 바로 '향피우기'라네! 무슨 향으로 피워보겠는가?",
    answer: ["빨간색 향", "초록색 향", "노란색 향"],
    imgsrc: "/assets/Qnaimges/qna2.gif",
    talk: [
      {
        who: ["You", "You"],
        content: [
          "향에 불을 붙히니 과일같은 달콤한 향이 난다.",
          "향에 취해 눈을 감았다 뜨니, 산 속이다.. 이 곳이 흑산인가? \n\n그런데 어디선가 목소리가 들려오는 것 같은데...?",
        ],
        talkimg: ["/assets/Qnaimges/qna2-a.gif", "/assets/Qnaimges/qna2-2.gif"],
      },
      {
        who: ["You", "You"],
        content: [
          "향에 불을 붙히니 어디선가 맡은 듯한 그리운 향이 난다.",
          "향에 취해 눈을 감았다 뜨니, 산 속이다.. 이 곳이 흑산인가? \n\n그런데 어디선가 목소리가 들려오는 것 같은데...?",
        ],
        talkimg: ["/assets/Qnaimges/qna2-b.gif", "/assets/Qnaimges/qna2-2.gif"],
      },
      {
        who: ["You", "You"],
        content: [
          "향에 불을 붙히니 따뜻한 당근 수프 향이 난다. \n군침이 싹.. 도는 걸?",
          "향에 취해 눈을 감았다 뜨니, 산 속이다.. 이 곳이 흑산인가? \n\n그런데 어디선가 목소리가 들려오는 것 같은데...?",
        ],
        talkimg: ["/assets/Qnaimges/qna2-c.gif", "/assets/Qnaimges/qna2-2.gif"],
      },
    ],
  },
  {
    question: "흑산이 당신에게 물어온다.. 당신이 바라는 이상향은?",
    answer: [
      "당근과 다래가 넘치는 흑산에서 먹방을 한다",
      "흑산에서 햇빛 아래 포근하게... 낮잠 타임...", 
      "세상 걱정 없는 흑산 위 넓은 평원에서 작은 금덩이 발견!"
    ],
    imgsrc: "/assets/Qnaimges/qna2-2.gif",
    talk: [
      {
        who: ["You"],
        content: ["젠틀한데 섬세한 면이 있군...\n\n특별히 당신의 귀여웠던 과거를 여행할 기회를 주지"],
        talkimg: ["/assets/Qnaimges/qna2-2.gif"],
      },
      {
        who: ["You"],
        content: ["속으로 자주 외로움을 타는 군..\n\n특별히 당신의 귀여웠던 과거를 여행할 기회를 주지"],
        talkimg: ["/assets/Qnaimges/qna2-2.gif"],
      },
      {
        who: ["You"],
        content: ["평온한듯 보이나, 지기 싫어하는 타입인가..?\n\n특별히 당신의 귀여웠던 과거를 여행할 기회를 주지"],
        talkimg: ["/assets/Qnaimges/qna2-2.gif"],
      }
    ],
  },
  {
    question: "과거로 돌아갈 수 있다면, 언제로 갈 것인가?",
    answer: [
      "내가 태어나길 기다리며 기대에 부푼 부모님을 볼래!", 
      "친구와 함께 걷던 초등학교 등굣길이 생각난다.",
      "성인이 되면 할 것을 적어두며 엄청 기대했었는데.."
    ],
    imgsrc: "/assets/Qnaimges/qna4.gif",
    talk: [
      {
        who: ["","You"],
        content: ["","아야!\n\n잠시 추억을 회상하며 걷고 있는데,\n어디선가 날아온 돌에 맞았다..!"],
        talkimg: ["","/assets/Qnaimges/qna4-1.gif"],
      },
      {
        who: ["","You"],
        content: ["","아야!\n\n잠시 추억을 회상하며 걷고 있는데,\n어디선가 날아온 돌에 맞았다..!"],
        talkimg: ["","/assets/Qnaimges/qna4-1.gif"],
      },
      {
        who: ["","You"],
        content: ["","아야!\n\n잠시 추억을 회상하며 걷고 있는데,\n어디선가 날아온 돌에 맞았다..!"],
        talkimg: ["","/assets/Qnaimges/qna4-1.gif"],
      }
    ],
  },
  {
    question: "갑자기 날아온 이 돌은 뭐지? 어떻게 할까?",
    answer: [
      "억울하다.. 범인을 찾으러 사방을 뒤진다.", 
      "맞은 부위를 연신 문지르며 있는 힘껏 앙앙 운다.",
      "내 추억을 깨다니! 주변에 있는 돌멩이를 마구잡이로 던진다."
    ],
    imgsrc: "/assets/Qnaimges/qna4-1.gif",
    talk: [
      {
        who: ["You", "You"],
        content: ["수풀에 숨어있던 건방진 햄찌를 잡아냈다.","어라..\n\n근데..."],
        talkimg: ["/assets/Qnaimges/qna5-1.gif","/assets/Qnaimges/qna5-1.gif"],
      },
      {
        who: ["You", "You"],
        content: ["어디선가 나타난 수상한 햄찌가 내 다리를 톡톡 치며 사과한다.","어라..\n\n근데..."],
        talkimg: ["/assets/Qnaimges/qna5-1.gif","/assets/Qnaimges/qna5-1.gif"],
      },
      {
        who: ["You", "You"],
        content: ["돌멩이가 떨어진 곳에 햄찌가 바들바들 떨고 있다....","어라..\n\n근데..."],
        talkimg: ["/assets/Qnaimges/qna5-1.gif","/assets/Qnaimges/qna5-1.gif"],
      }
    ],
  },
  {
    question: "이 햄찌 표정이..?",
    answer: [
      "🤩 (와우~ 어메이징)", 
      "😍 (사랑에 빠졌소)",
      "🥺 (사..살려주세요..)"
    ],
    imgsrc: "/assets/Qnaimges/qna5-1.gif",
    talk: [
      {
        who: ["You", "You"],
        content: ["엇...","귀엽다..\n역시귀여운게 최고다...\n\n음..? 그런데 햄찌가 뭐라고 말을 하는 것 같다."],
        talkimg: ["/assets/Qnaimges/qna6-a.gif","/assets/Qnaimges/qna6-a.gif"],
      },
      {
        who: ["You", "You"],
        content: ["엇...","귀엽다..\n역시귀여운게 최고다...\n\n음..? 그런데 햄찌가 뭐라고 말을 하는 것 같다."],
        talkimg: ["/assets/Qnaimges/qna6-b.gif","/assets/Qnaimges/qna6-b.gif"],
      },
      {
        who: ["You", "You"],
        content: ["엇...","귀엽다..\n역시귀여운게 최고다...\n\n음..? 그런데 햄찌가 뭐라고 말을 하는 것 같다."],
        talkimg: ["/assets/Qnaimges/qna6-c.gif","/assets/Qnaimges/qna6-c.gif"],
      }
    ],
  },
  {
    question: "혹시 괜찮다면... 나와 함께 바다로 놀러가찌 않을래?",
    answer: [
      "좋아!", 
      "아직 조금 괘씸하다.. 단칼에 거절!",
      "햄찌의 뺨을 만진다."
    ],
    imgsrc: "/assets/Qnaimges/qna7.gif",
    talk: [
      {
        who: ["햄찌", "You", "You", "햄찌", "You", "햄찌", "햄찌", "You","햄찌","햄찌","햄찌","햄찌", "You", "", "", "", "", "", ""],
        content: [
          "히히~ 고마워!\n\n얼른 같이 가찌!", 
          "작은 영혼이 나를 바다로 안내했다...\n\n탁 트인 바닷가 풍경에 마음이 괜히 뭉클해진다.",
          "문득 궁금해진 당신은 질문을 건넨다.\n\n근데 너 정체가 뭐야?",
          "나는 사장님이 보낸 직원이야.\n\n올해 너의 행복을 빌어주러 여기까지 왔찌!",
          "음.. 일하는 곳이 어딘데?",
          "웅~\n\n점집 ‘KUROSA’라구 들어봐찌?",
          "너가 길 안 잃게 잘 보면,\n\n사장님이 시급 9620원으로 올려주신대성~",
          "(올해 최저시급 아닌가?)\n\n그래서 나한테 돌을..?",
          "아앗.....\n\n그건 정말 미안해...!\n\n아무리 불러도 내 목소리가 안 들리는 거 같아서 어쩔 수 없었찌 모야..!",
          "내가 대신 좋은 정보를 알려줄게!",
          "여기서 다섯 발자국만 더 가면 소원을 들어주는 바다로 갈 수 있찌!\n\n한번 바다에 기도해봐~\n\n이뤄질 찌 모르잖아?",
          "히히! 난 다시 일하러 가야해서 이만 가볼게..!\n\n안녕~ 돌 던진 건 미안해찌!",
          "햄찌가 안내한 방향으로 당신은 걸어간다.",
        ],
        talkimg: [
          "/assets/Qnaimges/qna6-a.gif",
          "/assets/Qnaimges/qna8.gif",
          "/assets/Qnaimges/qna8.gif",
          "/assets/Qnaimges/qna7.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-2.gif",
          "/assets/Qnaimges/qna8-2.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-2.gif",
          "",
          "/assets/Qnaimges/footprint-0.gif",
          "/assets/Qnaimges/footprint-1.gif",
          "/assets/Qnaimges/footprint-2.gif",
          "/assets/Qnaimges/footprint-3.gif",
          "/assets/Qnaimges/footprint-4.gif",
          "/assets/Qnaimges/footprint-5.gif"
        ],
      },
      {
        who: ["You", "You", "You", "햄찌", "You", "햄찌", "햄찌", "You","햄찌","햄찌","햄찌","햄찌", "You", "", "", "", "", "", ""],
        content: [
            "히히~ 고마워!\n\n얼른 같이 가찌!", 
            "작은 영혼이 나를 바다로 안내했다...\n\n탁 트인 바닷가 풍경에 마음이 괜히 뭉클해진다.",
            "문득 궁금해진 당신은 질문을 건넨다.\n\n근데 너 정체가 뭐야?",
            "나는 사장님이 보낸 직원이야.\n\n올해 너의 행복을 빌어주러 여기까지 왔찌!",
            "음.. 일하는 곳이 어딘데?",
            "웅~\n\n점집 ‘KUROSA’라구 들어봐찌?",
            "너가 길 안 잃게 잘 보면,\n\n사장님이 시급 9620원으로 올려주신대성~",
            "(올해 최저시급 아닌가?)\n\n그래서 나한테 돌을..?",
            "아앗.....\n\n그건 정말 미안해...!\n\n아무리 불러도 내 목소리가 안 들리는 거 같아서 어쩔 수 없었찌 모야..!",
            "내가 대신 좋은 정보를 알려줄게!",
            "여기서 다섯 발자국만 더 가면 소원을 들어주는 바다로 갈 수 있찌!\n\n한번 바다에 기도해봐~\n\n이뤄질 찌 모르잖아?",
            "히히! 난 다시 일하러 가야해서 이만 가볼게..!\n\n안녕~ 돌 던진 건 미안해찌!",
            "햄찌가 안내한 방향으로 당신은 걸어간다.",
          ],
          talkimg: [
            "/assets/Qnaimges/qna6-c.gif",
            "/assets/Qnaimges/qna8.gif",
            "/assets/Qnaimges/qna8.gif",
            "/assets/Qnaimges/qna7.gif",
            "/assets/Qnaimges/qna8-1.gif",
            "/assets/Qnaimges/qna8-1.gif",
            "/assets/Qnaimges/qna8-1.gif",
            "/assets/Qnaimges/qna8-1.gif",
            "/assets/Qnaimges/qna8-2.gif",
            "/assets/Qnaimges/qna8-2.gif",
            "/assets/Qnaimges/qna8-1.gif",
            "/assets/Qnaimges/qna8-2.gif",
            "",
            "/assets/Qnaimges/footprint-0.gif",
            "/assets/Qnaimges/footprint-1.gif",
            "/assets/Qnaimges/footprint-2.gif",
            "/assets/Qnaimges/footprint-3.gif",
            "/assets/Qnaimges/footprint-4.gif",
            "/assets/Qnaimges/footprint-5.gif"
          ],
      },
      {
        who: ["You", "You", "You", "햄찌", "You", "햄찌", "햄찌", "You","햄찌","햄찌","햄찌","햄찌", "You", "", "", "", "", "", ""],
        content: [
            "히히~ 고마워!\n\n얼른 같이 가찌!", 
            "작은 영혼이 나를 바다로 안내했다...\n\n탁 트인 바닷가 풍경에 마음이 괜히 뭉클해진다.",
            "문득 궁금해진 당신은 질문을 건넨다.\n\n근데 너 정체가 뭐야?",
            "나는 사장님이 보낸 직원이야.\n\n올해 너의 행복을 빌어주러 여기까지 왔찌!",
            "음.. 일하는 곳이 어딘데?",
            "웅~\n\n점집 ‘KUROSA’라구 들어봐찌?",
            "너가 길 안 잃게 잘 보면,\n\n사장님이 시급 9620원으로 올려주신대성~",
            "(올해 최저시급 아닌가?)\n\n그래서 나한테 돌을..?",
            "아앗.....\n\n그건 정말 미안해...!\n\n아무리 불러도 내 목소리가 안 들리는 거 같아서 어쩔 수 없었찌 모야..!",
            "내가 대신 좋은 정보를 알려줄게!",
            "여기서 다섯 발자국만 더 가면 소원을 들어주는 바다로 갈 수 있찌!\n\n한번 바다에 기도해봐~\n\n이뤄질 찌 모르잖아?",
            "히히! 난 다시 일하러 가야해서 이만 가볼게..!\n\n안녕~ 돌 던진 건 미안해찌!",
            "햄찌가 안내한 방향으로 당신은 걸어간다.",
          ],
          talkimg: [
            "/assets/Qnaimges/qna6-b.gif",
            "/assets/Qnaimges/qna8.gif",
            "/assets/Qnaimges/qna8.gif",
            "/assets/Qnaimges/qna7.gif",
            "/assets/Qnaimges/qna8-1.gif",
            "/assets/Qnaimges/qna8-1.gif",
            "/assets/Qnaimges/qna8-1.gif",
            "/assets/Qnaimges/qna8-1.gif",
            "/assets/Qnaimges/qna8-2.gif",
            "/assets/Qnaimges/qna8-2.gif",
            "/assets/Qnaimges/qna8-1.gif",
            "/assets/Qnaimges/qna8-2.gif",
            "",
            "/assets/Qnaimges/footprint-0.gif",
            "/assets/Qnaimges/footprint-1.gif",
            "/assets/Qnaimges/footprint-2.gif",
            "/assets/Qnaimges/footprint-3.gif",
            "/assets/Qnaimges/footprint-4.gif",
            "/assets/Qnaimges/footprint-5.gif"
          ],
      },
    ],
  },
  {
    question: "바다가 당신에게 물어온다... 어떤 기적을 바라는가?",
    answer: ["제가 바라는 것은...", "", ""],
    imgsrc: "/assets/Qnaimges/qna8.gif",
    talk: [
      {
        who: ["바다", "You",""],
        content: ["그렇군.. 당신의 소원은 잘 전달해주도록 하지...", "기적에 감동한 당신은 눈물이 앞을 가린다...",""],
        talkimg: ["/assets/Qnaimges/qna8.gif","/assets/Qnaimges/qna8.gif",""],
      }
    ],
  },
  {
    question: "어때, 지루하진 않았지",
    answer: ["완전 내 생에 최고의 여행!","날 만족시키다니, 꽤 대단한 걸?","아무 생각이 없다"],
    imgsrc: "/assets/Images/talkLogo2.gif",
    talk: [
      {
        who: ["KUROSA", "KUROSA", ""],
        content: ["나쁘지 않았다면, 다행이군~\n우리 직원이 잘 안내한 모양이야", "그럼 이제 행운아이템을 알려줄게..\n\n기대하시라!", ""],
        talkimg: ["/assets/Images/talkLogo2.gif","/assets/Images/talkLogo2.gif", ""],
      },
      {
        who: ["KUROSA", "KUROSA", ""],
        content: ["나쁘지 않았다면, 다행이군~\n우리 직원이 잘 안내한 모양이야", "그럼 이제 행운아이템을 알려줄게..\n\n기대하시라!", ""],
        talkimg: ["/assets/Images/talkLogo2.gif","/assets/Images/talkLogo2.gif", ""],
      },
      {
        who: ["KUROSA", "KUROSA", ""],
        content: ["나쁘지 않았다면, 다행이군~\n우리 직원이 잘 안내한 모양이야", "그럼 이제 행운아이템을 알려줄게..\n\n기대하시라!", ""],
        talkimg: ["/assets/Images/talkLogo2.gif","/assets/Images/talkLogo2.gif", ""],
      }
    ],
  }
];

export default qna;
