const qna = [
  {
    question: "じゃあ、今から黒山に出発 する前に持っていくものを選んでみよ。",
    answer: [
      "山なら当然の杖だよ!",
      "もうお腹が空いている感じだ.. まん丸おにぎり",
      "山なら虫が多いと思うけど... 蚊取線香を持っていこう！",
    ],
    imgsrc: "/assets/Qnaimges/qna1.gif",
    talk: [
      {
        who: ["YOU", "KUROSA"],
        content: [
          "準備ができました！\n\n早く黒山に送って!",
          "そうか 決定が速いのう~ \n\n続けて一つ重要な儀式だけをすればいいんじゃ!",
        ],
        talkimg: ["/assets/Qnaimges/qna1.gif", "/assets/Qnaimges/NoBackgroundS.gif"],
      },
      {
        who: ["YOU", "KUROSA"],
        content: [
          "準備ができました！\n\n早く黒山に送って!",
          "そうか 決定が速いのう~ \n\n続けて一つ重要な儀式だけをすればいいんじゃ!",
        ],
        talkimg: ["/assets/Qnaimges/qna1.gif", "/assets/Qnaimges/NoBackgroundS.gif"],
      },
      {
        who: ["YOU", "KUROSA"],
        content: [
          "準備ができました！\n\n早く黒山に送って!",
          "そうか 決定が速いのう~ \n\n続けて一つ重要な儀式だけをすればいいんじゃ!",
        ],
        talkimg: ["/assets/Qnaimges/qna1.gif", "/assets/Qnaimges/NoBackgroundS.gif"],
      },
    ],
  },
  {
    question: "線香を一つ嗅いでこそ黒山 にたどり着ける。さあ、ど れにする？",
    answer: ["赤い線香", "緑の線香", "黄色い線香"],
    imgsrc: "/assets/Qnaimges/qna2.gif",
    talk: [
      {
        who: ["YOU", "YOU"],
        content: [
          "線香に火をつけると果物のような甘い香りがする",
          "香りに酔って目を閉じて開けたら、いつの間にか黒山だ。ここが黒山かな? \n\nところが、どこかで声が聞こえるみたいだけど...",
        ],
        talkimg: ["/assets/Qnaimges/qna2-a.gif", "/assets/Qnaimges/qna2-2.gif"],
      },
      {
        who: ["YOU", "YOU"],
        content: [
          "線香に火をつけると、どこかで嗅いだような懐かしい香りがする。",
          "香りに酔って目を閉じて開けたら、いつの間にか黒山だ。ここが黒山かな? \n\nところが、どこかで声が聞こえるみたいだけど...",
        ],
        talkimg: ["/assets/Qnaimges/qna2-b.gif", "/assets/Qnaimges/qna2-2.gif"],
      },
      {
        who: ["YOU", "YOU"],
        content: [
          "線香に火をつけると、温かいにんじんスープの香りがする。 \nよだれが出る...!",
          "香りに酔って目を閉じて開けたら、いつの間にか黒山だ。ここが黒山かな? \n\nところが、どこかで声が聞こえるみたいだけど...",
        ],
        talkimg: ["/assets/Qnaimges/qna2-c.gif", "/assets/Qnaimges/qna2-2.gif"],
      },
    ],
  },
  {
    question: "黒山が私に尋ねてくる。あなたが望む理想郷は？",
    answer: [
      "ニンジンと野いちごが溢れる 黒山でモッパン",
      "黒山で日差しの下、暖かく···昼寝タイム…", 
      "世の中の心配のない黒山の上の広い平原で小さな金塊を発 見！"
    ],
    imgsrc: "/assets/Qnaimges/qna2-2.gif",
    talk: [
      {
        who: ["YOU"],
        content: ["ワイルドなのに繊細な面があるね..\n\n特別にあなたの可愛かった過去を旅行する機会を与える。どう?"],
        talkimg: ["/assets/Qnaimges/qna2-2.gif"],
      },
      {
        who: ["YOU"],
        content: ["心の中でよく寂しがるね...\n\n特別にあなたの可愛かった過去を旅行する機会を与える。どう?"],
        talkimg: ["/assets/Qnaimges/qna2-2.gif"],
      },
      {
        who: ["YOU"],
        content: ["穏やかに見えるけど、負けず嫌いのタイプかな...?\n\n特別にあなたの可愛かった過去を旅行する機会を与える。どう?"],
        talkimg: ["/assets/Qnaimges/qna2-2.gif"],
      }
    ],
  },
  {
    question: "たった1日だけ過去に戻って遊べる機会! いつへ行く?",
    answer: [
      "私を待ちながら期待に膨らんだ両親に会う！-生まれた日", 
      "友達と一緒に歩いていた登校道を思い出す。-小学校卒業式",
      "大人になってやることをメモし ながらすごく期待してたのに... - 大人になる1日前"
    ],
    imgsrc: "/assets/Qnaimges/qna4.gif",
    talk: [
      {
        who: ["","YOU"],
        content: ["","痛っ！\n\nしばらく思い出を思い浮かべながら歩いていたら、どこからか飛んできた石にあたった...!"],
        talkimg: ["","/assets/Qnaimges/qna4-1.gif"],
      },
      {
        who: ["","YOU"],
        content: ["","痛っ！\n\nしばらく思い出を思い浮かべながら歩いていたら、どこからか飛んできた石にあたった...!"],
        talkimg: ["","/assets/Qnaimges/qna4-1.gif"],
      },
      {
        who: ["","YOU"],
        content: ["","痛っ！\n\nしばらく思い出を思い浮かべながら歩いていたら、どこからか飛んできた石にあたった...!"],
        talkimg: ["","/assets/Qnaimges/qna4-1.gif"],
      }
    ],
  },
  {
    question: "通りすがりに石にあたったあなた、どうする？",
    answer: [
      "悔しい..犯人を探しに四方をあさる。", 
      "石にあたった部位をこすりながら号泣",
      "私の思い出を壊すなんて、周りの石ころをむやみに投げつ ける。"
    ],
    imgsrc: "/assets/Qnaimges/qna4-1.gif",
    talk: [
      {
        who: ["YOU", "YOU"],
        content: ["茂みに隠れていた生意気なハムッチを捕まえた。","あれ..."],
        talkimg: ["/assets/Qnaimges/qna5-1.gif","/assets/Qnaimges/qna5-1.gif"],
      },
      {
        who: ["YOU", "YOU"],
        content: ["どこからか現れたハムッチが私の足を ツンツンつつきながら謝る。","あれ..."],
        talkimg: ["/assets/Qnaimges/qna5-1.gif","/assets/Qnaimges/qna5-1.gif"],
      },
      {
        who: ["YOU", "YOU"],
        content: ["石ころが落ちたところでハムッチがぶるぶる震えている。","あれ..."],
        talkimg: ["/assets/Qnaimges/qna5-1.gif","/assets/Qnaimges/qna5-1.gif"],
      }
    ],
  },
  {
    question: "このハムッチの表情が..?",
    answer: [
      "🤩 (うわーアメージングッチ)", 
      "😍 (恋に落ちたッチ)",
      "🥺 (アッ... 助けてッチ..)"
    ],
    imgsrc: "/assets/Qnaimges/qna5-1.gif",
    talk: [
      {
        who: ["YOU", "YOU"],
        content: ["あっ…!","可愛い...! やっぱり可愛いのが最高だ...\n\nん? ハムッチが何か言っているようだ。"],
        talkimg: ["/assets/Qnaimges/qna6-a.gif","/assets/Qnaimges/qna6-a.gif"],
      },
      {
        who: ["YOU", "YOU"],
        content: ["あっ…!","可愛い...! やっぱり可愛いのが最高だ...\n\nん? ハムッチが何か言っているようだ。"],
        talkimg: ["/assets/Qnaimges/qna6-b.gif","/assets/Qnaimges/qna6-b.gif"],
      },
      {
        who: ["YOU", "YOU"],
        content: ["あっ…!","可愛い...! やっぱり可愛いのが最高だ...\n\nん? ハムッチが何か言っているようだ。"],
        talkimg: ["/assets/Qnaimges/qna6-c.gif","/assets/Qnaimges/qna6-c.gif"],
      }
    ],
  },
  {
    question: "もしよかったら... 私と一緒に海に遊びに行かな いッチ？",
    answer: [
      "いいよ！", 
      "まだ少し許せない。キッパリ断る！",
      "ハムッチの頬を触る。"
    ],
    imgsrc: "/assets/Qnaimges/qna7.gif",
    talk: [
      {
        who: ["ハムッチ", "YOU", "YOU", "ハムッチ", "YOU", "ハムッチ", "ハムッチ", "YOU","ハムッチ","ハムッチ","ハムッチ","ハムッチ", "YOU", "", "", "", "", "", ""],
        content: [
          "ふふっ ありがとッチ！\n\n早く行くッチ、行くッチ!", 
          "小さな魂が私を海に案内した...\n\n広々とした海辺の風景に心が熱くなる。",
          "ふと気になったあなた 質問をする。\n\nところであなたの正体は何?",
          "私は社長が送った職員だッチ。\n\n今年 あなたの幸せを祈ってここまで来たッチ！",
          "どこで働いてるの？",
          "うん~\n\n占い屋 「KUROSA」って聞いた事あるッチ?",
          "あなたが道に迷わない様に案内したら、\n\n時給100円に上げてくれるって言ったッチ。",
          "(たった100円...?)\n\nそれで私に石を...?!",
          "それはごめんッチ...!\n\nいくら呼んでも私の声が聞こえないみたいで仕方なかったッチ...!",
          "代わりにいい情報を教えてあげるッチ。\n\nここからあと5歩進むと願いを叶えてくれる海に行けるッチ。",
          "一度海に祈ってみてッチ。叶うかどうか分からないッチ?\n\n私はまた仕事に行かないといけないから行くッチ...!",
          "又ねッチ～\n\n石を投げたのはごめんッチ!",
          "ハムッチが案内した方向にあなたは歩いていく。",
        ],
        talkimg: [
          "/assets/Qnaimges/qna6-a.gif",
          "/assets/Qnaimges/qna8.gif",
          "/assets/Qnaimges/qna8.gif",
          "/assets/Qnaimges/qna7.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-2.gif",
          "/assets/Qnaimges/qna8-2.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-2.gif",
          "",
          "/assets/Qnaimges/footprint-0.gif",
          "/assets/Qnaimges/footprint-1.gif",
          "/assets/Qnaimges/footprint-2.gif",
          "/assets/Qnaimges/footprint-3.gif",
          "/assets/Qnaimges/footprint-4.gif",
          "/assets/Qnaimges/footprint-5.gif"
        ],
      },
      {
        who: ["YOU", "YOU", "YOU", "ハムッチ", "YOU", "ハムッチ", "ハムッチ", "YOU","ハムッチ","ハムッチ","ハムッチ","ハムッチ", "YOU", "", "", "", "", "", ""],
        content: [
            "しまった.. 泣きそうな表情に結局 武装解除されてしまった。", 
            "小さな魂が私を海に案内した...\n\n広々とした海辺の風景に心が熱くなる。",
            "ふと気になったあなた 質問をする。\n\nところであなたの正体は何?",
            "私は社長が送った職員だッチ。\n\n今年 あなたの幸せを祈ってここまで来たッチ！",
            "どこで働いてるの？",
            "うん~\n\n占い屋 「KUROSA」って聞いた事あるッチ?",
            "あなたが道に迷わない様に案内したら、\n\n時給100円に上げてくれるって言ったッチ。",
            "(たった100円...?)\n\nそれで私に石を...?!",
            "それはごめんッチ...!\n\nいくら呼んでも私の声が聞こえないみたいで仕方なかったッチ...!",
            "代わりにいい情報を教えてあげるッチ。\n\nここからあと5歩進むと願いを叶えてくれる海に行けるッチ。",
            "一度海に祈ってみてッチ。叶うかどうか分からないッチ?\n\n私はまた仕事に行かないといけないから行くッチ...!",
            "又ねッチ～\n\n石を投げたのはごめんッチ!",
            "ハムッチが案内した方向にあなたは歩いていく。",
        ],
        talkimg: [
          "/assets/Qnaimges/qna6-c.gif",
          "/assets/Qnaimges/qna8.gif",
          "/assets/Qnaimges/qna8.gif",
          "/assets/Qnaimges/qna7.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-2.gif",
          "/assets/Qnaimges/qna8-2.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-2.gif",
          "",
          "/assets/Qnaimges/footprint-0.gif",
          "/assets/Qnaimges/footprint-1.gif",
          "/assets/Qnaimges/footprint-2.gif",
          "/assets/Qnaimges/footprint-3.gif",
          "/assets/Qnaimges/footprint-4.gif",
          "/assets/Qnaimges/footprint-5.gif"
        ],
      },
      {
        who: ["YOU", "YOU", "YOU", "ハムッチ", "YOU", "ハムッチ", "ハムッチ", "YOU","ハムッチ","ハムッチ","ハムッチ","ハムッチ", "YOU", "", "", "", "", "", ""],
        content: [
            "可愛くて思わずうなずいてしまった！", 
            "小さな魂が私を海に案内した...\n\n広々とした海辺の風景に心が熱くなる。",
            "ふと気になったあなた 質問をする。\n\nところであなたの正体は何?",
            "私は社長が送った職員だッチ。\n\n今年 あなたの幸せを祈ってここまで来たッチ！",
            "どこで働いてるの？",
            "うん~\n\n占い屋 「KUROSA」って聞いた事あるッチ?",
            "あなたが道に迷わない様に案内したら、\n\n時給100円に上げてくれるって言ったッチ。",
            "(たった100円...?)\n\nそれで私に石を...?!",
            "それはごめんッチ...!\n\nいくら呼んでも私の声が聞こえないみたいで仕方なかったッチ...!",
            "代わりにいい情報を教えてあげるッチ。\n\nここからあと5歩進むと願いを叶えてくれる海に行けるッチ。",
            "一度海に祈ってみてッチ。叶うかどうか分からないッチ?\n\n私はまた仕事に行かないといけないから行くッチ...!",
            "又ねッチ～\n\n石を投げたのはごめんッチ!",
            "ハムッチが案内した方向にあなたは歩いていく。",
        ],
        talkimg: [
          "/assets/Qnaimges/qna6-b.gif",
          "/assets/Qnaimges/qna8.gif",
          "/assets/Qnaimges/qna8.gif",
          "/assets/Qnaimges/qna7.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-2.gif",
          "/assets/Qnaimges/qna8-2.gif",
          "/assets/Qnaimges/qna8-1.gif",
          "/assets/Qnaimges/qna8-2.gif",
          "",
          "/assets/Qnaimges/footprint-0.gif",
          "/assets/Qnaimges/footprint-1.gif",
          "/assets/Qnaimges/footprint-2.gif",
          "/assets/Qnaimges/footprint-3.gif",
          "/assets/Qnaimges/footprint-4.gif",
          "/assets/Qnaimges/footprint-5.gif"
        ],
      },
    ],
  },
  {
    question: "海があなたの祈りに答えた！ どんな奇跡を望む？",
    answer: ["私が望むのは...", "",""],
    imgsrc: "/assets/Qnaimges/qna8.gif",
    talk: [
      {
        who: ["海", "YOU"],
        content: ["そうなのかい...あなたの願いをかなえてあげようよう...", "奇跡に感動したあなた涙で前が見えなくなる..."],
        talkimg: ["/assets/Qnaimges/qna8.gif","/assets/Qnaimges/qna8.gif"],
      }
    ],
  },
  {
    question: "どうだい退屈しなかったじゃろ？",
    answer: ["私の人生の中で最高の旅行！","私を満足させるなんて…かなり すごいかも？","何も考えてない"],
    imgsrc: "/assets/Qnaimges/NoBackgroundS.gif",
    talk: [
      {
        who: ["KUROSA", "KUROSA", ""],
        content: ["面白かったら、幸いじゃ〜\n私のスタッフがよく案内したようじゃな。", "それじゃあ、あなたのラッキーアイテムを教えよう。\n\n期待しておれ!", ""],
        talkimg: ["/assets/Qnaimges/NoBackground.gif", "/assets/Qnaimges/NoBackgroundS.gif", ""],
      },
      {
        who: ["KUROSA", "KUROSA", ""],
        content: ["面白かったら、幸いじゃ〜\n私のスタッフがよく案内したようじゃな。", "それじゃあ、あなたのラッキーアイテムを教えよう。\n\n期待しておれ!", ""],
        talkimg: ["/assets/Qnaimges/NoBackground.gif", "/assets/Qnaimges/NoBackgroundS.gif", ""],
      },
      {
        who: ["KUROSA", "KUROSA", ""],
        content: ["面白かったら、幸いじゃ〜\n私のスタッフがよく案内したようじゃな。", "それじゃあ、あなたのラッキーアイテムを教えよう。\n\n期待しておれ!", ""],
        talkimg: ["/assets/Qnaimges/NoBackground.gif", "/assets/Qnaimges/NoBackgroundS.gif", ""],
      }
    ],
  }
];

export default qna;
