const ResultDataKor = [
  {
    img: "/assets/Images/item_시야본주.gif",
    info: [
      "악한 기운으로부터 당신을 지켜줄 검은 토끼의 눈.",
      "지니는 동안 이 부적이 깨졌다면, 당신에게 다가온 사악한 힘으로부터 지켜주었다는 증거라네.",
      "안심하게나!",
    ],
  },
  {
    img: "/assets/Images/item_3MM리본.gif",
    info: [
      "하찮다고 함부로 생각 말라!",
      "작으면 작을 수록 귀여움은 극대화되는 것이 진리.",
      "당신도 이 리본을 지니면 굉장히 귀여워질 것이다. 두근두근!",
    ],
  },
  {
    img: "/assets/Images/item_건초푸딩.gif",
    info: [
      "12개의 건초가 들어간 건초 푸딩.",
      "내가 만들었으니 맛은 장담하지.",
      "한해 12개월 동안 건초를 먹을 때의 행복함으로 가득 채워지길 바라는 마음을 담아 만들었다네.",
      "해피 파워!",
    ],
  },
  {
    img: "/assets/Images/item_새끼발톱네일.gif",
    info: [
      "인생 최대 고통은 서랍에 새끼 발가락 찧는 것까지만..",
      "그 이상 아플 일은 없도록 1년 동안 당신의 건강을 지켜줄 것이라네.",
      "⚠️ 주의 사항 - 강아지가 핥으려 하면 도망가시오.",
    ],
  },
  {
    img: "/assets/Images/item_압축빤스.gif",
    info: [
      "이게 제일 최고긴 해..",
      "일단 귀엽지 않은가?",
      "빤스에 스민 행운이 빠져나가지 않도록 압축해서 지니고 다니도록...",
      "소중하게 대하면 빤스도 그에 맞는 보답을 할 것이야.",
    ],
  },
  {
    img: "/assets/Images/item_갓빠진사랑니.gif",
    info: [
      "모양도 심보도 고약한 골칫덩이 사랑니.",
      "이 제멋대로인 녀석이 미울수도 있지만 말야, 몸에 지니고 다니면 원인 모를 자신감이 생길지도!",
      "단, 세 개 이상을 들고 다니는 건 금지하도록 하게.",
    ],
  },
  {
    img: "/assets/Images/item_끈적끈적막대사탕.gif",
    info: [
      "끈적하고 달콤한 막대 사탕.",
      "무엇이든 끈질긴 것이 중요하단 건 알고 있겠지?",
      "이 사탕을 들고 다니면 무슨 일이든 끈덕지게, 끝까지 해낼 수 있을 걸세.",
    ],
  },
  {
    img: "/assets/Images/item_새벽에자른손톱.gif",
    info: [
      "자신이 너무나도 초라하게 느껴질 때는 초승달을 닮은 손톱 한 조각을 주머니에 넣고 다녀보게나.",
      "작은 손톱, 그 조그마한 것의 힘은 자네가 생각하는 것보다 훨씬 위대하다네.",
    ],
  },
  {
    img: "/assets/Images/item_동백꽃잎한장.gif",
    info: [
      "한겨울 가장 먼저 피어난 동백꽃잎 한 장을 몸에 지니고 다니면,",
      "그 누구보다도 빠르게 시련을 헤쳐나갈 힘이 생길 걸세.",
      "⚠️ 주의 사항 - 빠르게 핀 꽃은 빨리 진다는 것을 잊지 말도록.",
    ],
  },
  {
    img: "/assets/Images/item_삼색복주머니.gif",
    info: [
      "세가지 색으로 이루어진 복 주머니.",
      "무엇이 들어있을지 알 수 없지만 지니고 다니는 것만으로도 행운이 찾아올 것 같은 기분이 들지 않는가?",
      "예상치 못한 행운을 마주할 준비를 하게. 금방이니까.",
    ],
  },
];

export default ResultDataKor;
