const ResultDataJp = [
  {
    img: "/assets/Images/item_시야본주Jp.gif",
    info: [
      "邪悪なオーラからあなたを守る黒ウサギの目。",
      "あなたが持っている間にアイテムが壊れたなら、あなたに近づいた邪悪な力から守ってくれたという証拠じゃ。",
      "安心しておれ！",
    ],
  },
  {
    img: "/assets/Images/item_3MM리본Jp.gif",
    info: [
      "面倒だとむやみに考えてはダメじゃ。小さければ小さいほど可愛さは最大化されるもんじゃ。",
      "若いもん このリボンを持っておればとても可愛くなることじゃろう。",
      "ドキドキ！",
    ],
  },
  {
    img: "/assets/Images/item_건초푸딩Jp.gif",
    info: [
      "12種類の干し草が入った干し草プリン。わしが作ったから、味は保証しよう。",
      "1年12ヶ月間干し草を食べて 幸せさいっぱいになることを願って心を込めて作ったんじゃ。",
      "これが ハッピーパワー！",
    ],
  },
  {
    img: "/assets/Images/item_새끼발톱네일Jp.gif",
    info: [
      "人生最大の痛みは、引き出しにつま先をぶつける事までじゃ…",
      "それ以上 辛いことがないように 1年間若いもんの健康を守ってくれるじゃろう。",
      "⚠️ 注意事項 - 子犬が舐めようとしたら逃げてください。",
    ],
  },
  {
    img: "/assets/Images/item_압축빤스Jp.gif",
    info: [
      "これが一番最高じゃ…",
      "一旦 可愛いじゃろ？パンチュの幸運が抜けないように圧縮して持ち歩くようにしたら良いじゃろう。",
      "大切に扱えばパンチュもそれに合った報いをするじゃろう。",
    ],
  },
  {
    img: "/assets/Images/item_갓빠진사랑니Jp.gif",
    info: [
      "形も芯も厄介者の親知らず このわがままなもんが憎いかもしれんけどな、",
      "身につけておると原因不明な自信が生まれるかもぞ！",
      "⚠️ 注意事項 - 三つ以上持ち歩くのは禁止じゃ。",
    ],
  },
  {
    img: "/assets/Images/item_끈적끈적막대사탕Jp.gif",
    info: [
      "粘着性と甘いキャンディー..",
      "何でも粘り強いことが重要なのは知っておるじゃろう？",
      "このキャンディーを持っておれば何事でも粘り強く、最後までこなせるようになるじゃろう。",
    ],
  },
  {
    img: "/assets/Images/item_새벽에자른손톱Jp.gif",
    info: [
      "自分があまりにもぼろぼろに感じるときは、三日月に似た爪一枚をポケットに入れてみたら よいじゃろ。",
      "小さな力は若いもんが思うよりもはるかに素晴らしいことじゃろう。",
    ],
  },
  {
    img: "/assets/Images/item_동백꽃잎한장Jp.gif",
    info: [
      "真冬一番早く咲いたツバキの花びら一枚を身につけておると、",
      "誰よりも早く試練を乗り越えられるじゃろう。",
      "⚠️ 注意事項 - ただし、早く咲く花は 早く散ることを忘れないように...",
    ],
  },
  {
    img: "/assets/Images/item_삼색복주머니Jp.gif",
    info: [
      "三色から成る福袋。",
      "何が入っているのか分からないが、持ち歩くだけでも幸運が訪れるような気がしないか？",
      "予期せぬ幸運が 訪れる準備をするように。もうすぐじゃからな。",
    ],
  },
];

export default ResultDataJp;
